//1. Создать массив типа double с размером 4.
// Записать в него любые значения с помощью блока для инициализации. 
// Вывести на консоль значение первого элемента. 
 
package by.academy.lesson4.classwork;

public class MassiveTask1 {
	public static void main(String[] args) {
	
		double [] array	= {6.0, 0.5, 0.6, 7.0};
		System.out.println (array[0]);
	}
}
