package by.academy.lesson4.classwork;

public class Task1 {
	public static void main(String[] args) {
//	1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
//
		for (int q = 10; q < 20; q++) {
			System.out.println(q * q);
		}
	}
}
